#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/devperimental/package-setup/runs/run-SJmn7AR3Va2xX2iy

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
github_repository_collaborator.a_repo_collaborator["component-email"]: Refreshing state... [id=component-email:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-dataaccess"]: Refreshing state... [id=component-dataaccess:chrisxpr]
github_repository.template-repo["component-email"]: Refreshing state... [id=component-email]
github_repository.template-repo["component-dataaccess"]: Refreshing state... [id=component-dataaccess]
github_repository.template-repo["component-sms"]: Refreshing state... [id=component-sms]
github_repository.template-repo["component-payments"]: Refreshing state... [id=component-payments]
github_repository_collaborator.a_repo_collaborator["component-sms"]: Refreshing state... [id=component-sms:chrisxpr]
github_repository.template-repo["component-servicehelper"]: Refreshing state... [id=component-servicehelper]
github_repository.template-repo["component-externalapis"]: Refreshing state... [id=component-externalapis]
github_repository.template-repo["component-settings"]: Refreshing state... [id=component-settings]
github_repository_collaborator.a_repo_collaborator["component-externalapis"]: Refreshing state... [id=component-externalapis:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-settings"]: Refreshing state... [id=component-settings:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-payments"]: Refreshing state... [id=component-payments:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-servicehelper"]: Refreshing state... [id=component-servicehelper:chrisxpr]
github_actions_secret.repo_secret["component-payments"]: Refreshing state... [id=component-payments:NUGET_PAT]
github_actions_secret.repo_secret["component-servicehelper"]: Refreshing state... [id=component-servicehelper:NUGET_PAT]
github_actions_secret.repo_secret["component-externalapis"]: Refreshing state... [id=component-externalapis:NUGET_PAT]
github_actions_secret.repo_secret["component-settings"]: Refreshing state... [id=component-settings:NUGET_PAT]
github_actions_secret.repo_secret["component-dataaccess"]: Refreshing state... [id=component-dataaccess:NUGET_PAT]
github_actions_secret.repo_secret["component-sms"]: Refreshing state... [id=component-sms:NUGET_PAT]
github_actions_secret.repo_secret["component-email"]: Refreshing state... [id=component-email:NUGET_PAT]
github_branch_protection.template-repo["component-email"]: Refreshing state... [id=BPR_kwDOJCfPzc4CEZ5i]
github_branch_protection.template-repo["component-servicehelper"]: Refreshing state... [id=BPR_kwDOJCfP0s4CEZ5d]
github_branch_protection.template-repo["component-dataaccess"]: Refreshing state... [id=BPR_kwDOJCfPns4CEZ5f]
github_branch_protection.template-repo["component-payments"]: Refreshing state... [id=BPR_kwDOJCfPqc4CEZ5e]
github_branch_protection.template-repo["component-sms"]: Refreshing state... [id=BPR_kwDOJCfPls4CEZ5c]
github_branch_protection.template-repo["component-externalapis"]: Refreshing state... [id=BPR_kwDOJCfPt84CEZ5a]
github_branch_protection.template-repo["component-settings"]: Refreshing state... [id=BPR_kwDOJCfPss4CEZ5j]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.repo_secret["component-queues"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-queues"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repo_secret["component-servicehelper"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-servicehelper"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repo_secret["component-settings"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-settings"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repo_secret["component-storage"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-storage"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.template-repo["component-dataaccess"] will be updated in-place
  ~ resource "github_branch_protection" "template-repo" {
        id                              = "BPR_kwDOJCfPns4CEZ5f"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ restrict_dismissals             = false -> true
            # (5 unchanged attributes hidden)
        }
    }

  # github_branch_protection.template-repo["component-email"] will be updated in-place
  ~ resource "github_branch_protection" "template-repo" {
        id                              = "BPR_kwDOJCfPzc4CEZ5i"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ restrict_dismissals             = false -> true
            # (5 unchanged attributes hidden)
        }
    }

  # github_branch_protection.template-repo["component-externalapis"] will be updated in-place
  ~ resource "github_branch_protection" "template-repo" {
        id                              = "BPR_kwDOJCfPt84CEZ5a"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ restrict_dismissals             = false -> true
            # (5 unchanged attributes hidden)
        }
    }

  # github_branch_protection.template-repo["component-payments"] will be updated in-place
  ~ resource "github_branch_protection" "template-repo" {
        id                              = "BPR_kwDOJCfPqc4CEZ5e"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ restrict_dismissals             = false -> true
            # (5 unchanged attributes hidden)
        }
    }

  # github_branch_protection.template-repo["component-queues"] will be created
  + resource "github_branch_protection" "template-repo" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = true
        }
    }

  # github_branch_protection.template-repo["component-servicehelper"] will be updated in-place
  ~ resource "github_branch_protection" "template-repo" {
      ~ enforce_admins                  = false -> true
        id                              = "BPR_kwDOJCfP0s4CEZ5d"
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ restrict_dismissals             = false -> true
            # (5 unchanged attributes hidden)
        }
    }

  # github_branch_protection.template-repo["component-settings"] will be updated in-place
  ~ resource "github_branch_protection" "template-repo" {
      ~ enforce_admins                  = false -> true
        id                              = "BPR_kwDOJCfPss4CEZ5j"
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ restrict_dismissals             = false -> true
            # (5 unchanged attributes hidden)
        }
    }

  # github_branch_protection.template-repo["component-sms"] will be updated in-place
  ~ resource "github_branch_protection" "template-repo" {
        id                              = "BPR_kwDOJCfPls4CEZ5c"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ restrict_dismissals             = false -> true
            # (5 unchanged attributes hidden)
        }
    }

  # github_branch_protection.template-repo["component-storage"] will be created
  + resource "github_branch_protection" "template-repo" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = true
        }
    }

  # github_repository.template-repo["component-queues"] will be created
  + resource "github_repository" "template-repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Queue Component Repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "component-queues"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + template {
          + owner      = "devperimental"
          + repository = "nuget-package-template"
        }
    }

  # github_repository.template-repo["component-storage"] will be created
  + resource "github_repository" "template-repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Storage Component Repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "component-storage"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + template {
          + owner      = "devperimental"
          + repository = "nuget-package-template"
        }
    }

  # github_repository_collaborator.a_repo_collaborator["component-queues"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "component-queues"
      + username                    = "chrisxpr"
    }

  # github_repository_collaborator.a_repo_collaborator["component-storage"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "component-storage"
      + username                    = "chrisxpr"
    }

Plan: 10 to add, 7 to change, 0 to destroy.


```

</details>

*Pushed by: @devperimental, Action: `pull_request`*